GHB2/src/InformationRegisters/гхб_СоставГруппПомещений/гхб_СоставГруппПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СоставГруппПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаПомещений</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СоставГруппПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоГруппеПомещений(_ГруппаПомещений) Экспорт 
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_ГруппаПомещений) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_СоставГруппПомещенийСрезПоследних.Помещение КАК Помещение
		               |ИЗ
		               |	РегистрСведений.гхб_СоставГруппПомещений.СрезПоследних(, ГруппаПомещений = &ГруппаПомещений) КАК гхб_СоставГруппПомещенийСрезПоследних
		               |ГДЕ
		               |	НЕ гхб_СоставГруппПомещенийСрезПоследних.Закрыть";
		
		Запрос.УстановитьПараметр("ГруппаПомещений", _ГруппаПомещений);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			_Структура = Новый Структура();
			_Структура.Вставить("Помещение", Выборка.Помещение);
				
			_Массив.Добавить(_Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
